#+BEGIN_EXPORT html
---
layout: post
title: Learning methodology
subtitle: feel and view
permalink: /methodology.html
categories: [Learning, Methodology]
tags: [emacs, org-mode, org-agenda, double-loop-learning]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export
#+CATEGORY: Meta
#+TODO: RAW INIT TODO ACTIVE | DONE

* INIT Intro
SCHEDULED: <2024-03-30 Sat ++4d>
:PROPERTIES:
:LAST_REPEAT: [2023-11-21 Tue 18:11]
:END:
:LOGBOOK:
CLOCK: [2024-01-31 Wed 13:14]--[2024-01-31 Wed 13:15] =>  0:01
:END:
- State "DONE"       from "ACTIVE"     [2023-11-21 Tue 18:11]
- State "DONE"       from "ACTIVE"     [2023-11-17 Fri 08:56]
- State "DONE"       from "ACTIVE"     [2023-11-13 Mon 12:03]

#+begin_quote
In its most common sense, methodology is the study of research
methods. However, the term can also refer to the methods themselves or
to the philosophical discussion of associated background
assumptions. A method is a structured procedure for bringing about a
certain goal, like acquiring knowledge or verifying knowledge
claims. This normally involves various steps, like choosing a sample,
collecting data from this sample, and interpreting the data.  More at
Wikipedia
#+end_quote

#+begin_quote
It is a set of systems, methods, procedures or rules that is used to
conduct a structured research process for a thesis or dissertation.
The main purpose of the methodology is to be able to come up with an
original and significant outcome that will contribute towards the
field of your research.
#+end_quote

#+begin_quote
Method is a noun that means a procedure, technique, or way of doing
something, especially in accordance with a definite plan. It can
also be an adjective that means of, relating to, or employing the
Method. See synonyms, origin, and examples of method in sentences. 

#+end_quote


  Searching your ways and approaches for learning and process
  information is a complex and constantly evolving process.  They can
  impact how you understand, retain and apply new material.  However
  it is utter importance find it if you want achieve the best learning
  outcome and your solid base of personal knowledge.
    
* RAW [#C] What is methodology
 SCHEDULED: <2024-03-26 Tue ++4d>
 :PROPERTIES:
 :LAST_REPEAT: [2023-11-23 Thu 11:38]
 :END:
 - State "DONE"       from "ACTIVE"     [2023-11-23 Thu 11:38]
 - State "DONE"       from "ACTIVE"     [2023-11-19 Sun 12:38]
 - State "DONE"       from "ACTIVE"     [2023-11-15 Wed 09:03]
 :LOGBOOK:
 CLOCK: [2023-11-15 Wed 08:01]--[2023-11-15 Wed 09:03] =>  1:02
 :END:
 A "methodology" is a system of methods and principles in particular
 area to perform some complex task.

 System is a regularly interacting or interdependent group of items
 forming a unified whole.  A set of connected things or devices that
 operate together.

 Method is a particular way of doing something.

 Principle - is a basic idea or rule that explains or controls how
 something happens or works.  Basic rules or laws.

 I define learning methodology simply as your strategical understanding of
 how you receive information to best learn.

* RAW Applied methodology
SCHEDULED: <2024-03-15 Fri ++4d>
:PROPERTIES:
:LAST_REPEAT: [2023-11-20 Mon 16:13]
:END:

- State "DONE"       from "ACTIVE"     [2023-11-20 Mon 16:13]
- State "DONE"       from "ACTIVE"     [2023-11-16 Thu 08:30]

Learning methodology is a system of methods, principles and practices
used to increase ....

In essence it is the learning of how to learn. *<== Wrong*

The result of learning is defined as:



There are /several scientifically approved techniques and methods/
that help in the learning process itself and, in addition, help to
make the learning process more effective or /productive/.  =and also
help you achieve the best result.=

They are include:

** Double loop learning

is an iterative model which posits that higher-order learning involves
two processes or loops.

#+begin_quote
In double loop learning, problems are examined and corrected even
though correction requires challenge to underlying policies and
objectives.

Single loop learning - this form of learning aims at solving the
increasing changes and the problems that have risen as a consequence
of this. However, this ignores the real cause of the problem.

Double loop learning - this form of learning will go more deeply into
the cause of the problem and feedback is used to look at past actions.
#+end_quote


** Pomodoro technique

#+begin_quote
The Pomodoro Technique is a time management method developed by
Francesco Cirillo in the late 1980s. It uses a kitchen timer to break
work into intervals, typically 25 minutes in length, separated by
short breaks. Each interval is known as a pomodoro
#+end_quote

** Feyman's technique

#+begin_quote
The Feynman Technique, developed by Richard Feynman, is a study method
for students to learn through the act of teaching. To use the
technique, students choose a topic and then explain it in their own
words as if teaching a sixth-grader. Then, they improve their
explanations and go through the process again until they have mastered.
#+end_quote

** Deliberate practice

#+begin_quote
Deliberate practice refers to a special type of practice that is
purposeful and systematic. While regular practice might include
mindless repetitions, deliberate practice requires focused attention
and is conducted with the specific goal of improving performance.
#+end_quote

** Spaced repetition

#+begin_quote
Spaced repetition is a memory technique that involves reviewing and
recalling information at optimal spacing intervals until the
information is learned. It helps your brain remember more information,
reduces forgetting, and improves long-term memory recall.

"Spaced repetition" is when you repeatedly revisit material at
designated intervals. Author Barbara Oakley advises using this
strategy with active recall studying because it will engrain the
information in your memory better than the same amount of study
crammed into a single session.
#+end_quote

* RAW [#C] Unavoidable necessities
SCHEDULED: <2024-03-26 Tue ++4d>
:PROPERTIES:
:LAST_REPEAT: [2023-11-23 Thu 11:38]
:END:

- State "DONE"       from "ACTIVE"     [2023-11-23 Thu 11:38]
- State "DONE"       from "ACTIVE"     [2023-11-19 Sun 12:38]
- State "DONE"       from "ACTIVE"     [2023-11-15 Wed 09:24]

** Prepare yourself mentally:
to learn is essential for a successful and
fulfilling learning process and futher best result.
Before you start your learning, answer yourself the questions:

- What do I want to achieve in life?
- What are the reasons I chose this specialty?
- Where do I want to see myself in 5 years? In 10 yrs?
- What do I need to do to reach those goals?

** RAW [#C] Decompose the Whole Task
SCHEDULED: <2024-03-26 Tue>
:PROPERTIES:
:CATEGORY: Meta
:END:

https://www.youtube.com/watch?v=HZRDUZuIKg4
https://www.youtube.com/watch?v=vJ4bXM185qE

If you feel like you have too much to study or don't know where to
start break your studying into manageable chunks and create a study
plan to help you stay organized.

** Source of Knowledge 

Determine the list of educational material that you need to study.
Find the best sources for this material.
For each subject it is necessary to draw up a list of questions that need
to be studied.

** Keep clear

The workplace should be clean without unnecessary objects. So that you are
not distracted and be able to focus as much as possible.
Get enough sleep before studying. Eat less can make your brain more clear and easier
to focus on the task.


* RAW Daily ToDo List
SCHEDULED: <2024-03-30 Sat>

Naturally it should be composed from initially ~complex~ tasks for
decomposition and already prepared ~atomic~ tasks for elaboration.

The great tool to use in your day-to-day life is a simple and dense
~todo~ list with all tasks written down.

<<<<<<< HEAD
* RAW [#C] How to create the best weekly agenda?
SCHEDULED: <2024-03-26 Tue>
=======
** ToDo States

and their purpose

*** ~RAW~

- Terms and words might be uncertain and unclear - translate it...;
- The task is new and uncertain by its nature. Possible and on average
  it might been decomposed into a set of components (/offsprings/);

*** ~INIT~

*** 

*** 

*** ~DP2~

New knowledge and tecnhiques fluent utilizing in a variety of usual
day-to-day professional tasks.

** Priorities

** Shift It Out

* TODO How to create the raw weekly todo list?
SCHEDULED: <2024-03-30 Sat>
>>>>>>> ebffc2e5bfbfe35a16018a8e301e2317cbc978b7
:PROPERTIES:
:CATEGORY: Compilation
:END:

A weekly agenda is a document that contains a list of the tasks that
you plan to do or the goals that you want to achieve in a span of
seven days. It is a behavioral guide that is often practiced by some
people who have purpose and directions in their lives and want to
achieve success.

For the current moment in my weekly agenda I have:
1. A list of several key tasks that are important to complete daily
   and therefore they are repeated every day;
2. List of tasks that are important to complete on specific days of
   the week and therefore they are repeated from week to week;
3. List of tasks for the current day that was selected randomly and
   often unrelated to each other.

How to improve a weekly agenda?

1. Select a particular day to compose and review your weekly agenda;
2. Write your long-term goals;
3. Divide your long-term goals into smaller tasks;
4. Group small tasks by their subject and categories and determine which
   ones you can complete during the week;
6. Some tasks coan be more important than others while working toward
   your goals. Think about what your priorities for that week are and
   write them.
7. Schedule your tasks;
8. Review your progress on your previous week's plan to help you
   modify your goals and create new tasks;
9. If there were any tasks you didn't complete, consider placing them
   on your weekly work plan again;
10. Regularly examine your long-term goals and decide if there are any
   changes to make to them or additional tasks that you may need to
   perform.
   
<<<<<<< HEAD
* RAW [#C] What is the average time you should spend on each session
=======
* RAW [#C] What is the average amount of time you should spend on each session
SCHEDULED: <2024-03-26 Tue ++4d>
:PROPERTIES:
:LAST_REPEAT: [2023-12-16 Sat 16:39]
:END:
- State "DONE"       from "ACTIVE"     [2023-12-16 Sat 16:39]
:LOGBOOK:
CLOCK: [2023-12-08 Fri 09:00]--[2023-12-08 Fri 09:29] =>  0:29
:END:

- State "DONE"       from "ACTIVE"     [2023-11-21 Tue 18:11]
- State "DONE"       from "ACTIVE"     [2023-11-17 Fri 08:04]
As an implementation of =double-loop-learning= approach might be
convenient to use these words in your ~TODO~ sequence during studying
computer science and programming:

#+begin_example
RAW Init DP0 Todo DP1 Active | Done
#+end_example


 - RAW state is for just captured and unscheduled yet tasks;
 - After scheduling and Initial dissection task its status switches
   (++1d/2d) on to DeliberatePractice0 status;
 - After that (++1d/2d) it's time Todo the second loop in studying theory;
 - And soon (++1d/2d) it's very moment to another DP1 session;
 - Now material is well prepapared to be a handy tool in your hands
   and it is reasonably to shift a week ahead for final rehersal;
 - After that it's nothing to add - use these piece of knowledge and
   have fun out from it!


 #+begin_quote
All relevant questions should be questioned while task resolving.
 #+end_quote
 
 So, you *must* write these questions down during session and answer
 they a little bit later.

* RAW [#C] Raw state
SCHEDULED: <2024-03-26 Tue>
:PROPERTIES:
:END:

Is for just captured and unscheduled yet tasks. In this stage it is
necessary to find the best theoretical source for studying (in most
cases it is official documentation). Read the new material, understand
is it necessary to study itt in depth in future? If further learning
makes sense the task's state changes to *INIT* and it is scheduled.


* RAW [#C] Initial chapter dissection
SCHEDULED: <2024-03-26 Tue ++4d>
:PROPERTIES:
:LAST_REPEAT: [2023-11-21 Tue 18:12]
:END:

- State "DONE"       from "ACTIVE"     [2023-11-21 Tue 18:12]
- State "DONE"       from "ACTIVE"     [2023-11-17 Fri 08:55]

At the Initial chapter dissection stage, I begin a detailed and carefully
study of the material:
 - Determine a list of questions that I need to learn;
 - Schedule each question;
 - Start to learn each question in detail and extract of marrow from
   each studied material by doing some notes in my own words;
 - Write down all the questions that arise and find answers.
 - Read the material again.

After the initial analysis task it's status switches (++1d/2d) on
to *Deliberate practice 0 session*.
   
* RAW [#C] Deliberate practice 0 session
SCHEDULED: <2024-03-26 Tue ++4d>
:PROPERTIES:
:LAST_REPEAT: [2024-02-28 Wed 17:46]
:CATEGORY: Meta
:END:

- State "DONE"       from "ACTIVE"     [2024-02-28 Wed 17:46]
- State "DONE"       from "ACTIVE"     [2024-02-28 Wed 17:46]
- State "DONE"       from "ACTIVE"     [2023-11-21 Tue 18:12]
- State "DONE"       from "ACTIVE"     [2023-11-17 Fri 08:55]

On this stage I use pseudo tests from the books and practice with them
in my Python Interpreter and using Org-babel source code
opportunity. It partially allows me to understand how it works.

* ToDo session

Describe what you ought to do and in what manner it might be
implemented.


* Deliberate practice 1 session

Describe what you ought to do and in what manner it might be
implemented.


* Active session


Describe what you ought to do and in what manner it might be
implemented.

* RAW Tasks actualization
SCHEDULED: <2024-03-30 Sat>
[[info:org#TODO Extensions][org#TODO Extensions]]

Over time, a large number of tasks can accumulate in the personal
Agenda. And some of them may have lost their importance or urgency.
So, it is important to analyze the list of tasks in Agenda from time
to time and actualize them. For not urgent or not actual tasks it is
possible to switch their states to one of the chain:

#+begin_example
#+TODO: DELAY LAGRETARD | BARE
#+end_example

And also reschedule these tasks 28 days ahead. After 28
days you can reanalyze these tasks and decide which state to assign
them. It can be one of the states:

#+begin_example
#+TODO: RAW Init DP0 Todo DP1 Active | DONE
#+end_example

Or maybe you will decide to archive any tasks, postpone or come back
to them later.
It may be possible to supplement the Agenda with new
tasks. To do this, you can analyze the history in your browser.

* Conclusion
